const jsonData = {
    text: `<h1>QQ小程序平台许可及服务协议</h1>

    <p>欢迎您使用QQ小程序平台及服务！</p>
    
    <p><strong>为使用QQ小程序平台（以下简称&ldquo;本平台&rdquo;）及服务（以下简称&ldquo;本服务&rdquo;或&ldquo;小程序服务&rdquo;），当阅读并遵守《QQ小程序平台许可及服务协议》（以下简称&ldquo;本协议&rdquo;），以及<a href="http://www.qq.com/contract.shtml" rel="noopener noreferrer" target="_blank">《腾讯服务协议》</a>、<a href="http://zc.qq.com/chs/agreement1_chs.html" rel="noopener noreferrer" target="_blank">《QQ号码规则》</a>、<a href="http://privacy.qq.com/" rel="noopener noreferrer" target="_blank">《腾讯隐私政策》</a>。此外，您应当已经阅读、同意过包括但不限于<a href="https://download.developer.apple.com/Documentation/License_Agreements__Apple_Developer_Program/Apple_Developer_Program_License_Agreement_20180402.pdf" rel="noopener noreferrer" target="_blank">《Apple Developer Program许可协议》</a>、<a href="https://developer.apple.com/cn/app-store/review/guidelines/" rel="noopener noreferrer" target="_blank">《App Store 审核指南》</a>等终端设备系统、应用程序商店、市场等的协议规范。请您务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的相应条款，以及开通或使用某项服务的单独协议。限制、免责条款或其他涉及您重大权益的条款可能以加粗形式提示您注意。</strong></p>
    
    <p><strong>除非您已阅读并接受本协议所有条款，否则您无权使用本平台服务。您点击&ldquo;同意&rdquo;、&ldquo;下一步&rdquo;或您注册帐号、登录本服务、查看、发布信息等行为或您以其他任何明示或者默示方式标识接受本协议的，即视为您已阅读并同意本协议的约束。本协议即在您与腾讯之间产生法律效力，成为对双方具有约束力的法律文件。</strong></p>
    
    <p><strong>如果您因年龄、智力等因素而不具有完全民事行为能力，请在法定监护人的陪同下阅读和判断是否同意本协议及其他相关协议，并特别注意未成年人使用条款。</strong></p>
    
    <p><strong>一、【协议的范围】</strong></p>
    
    <p>1.1 本协议是您与腾讯之间关于您使用本服务所订立的协议。&ldquo;用户&rdquo;是指注册、登录、使用QQ小程序的个人或组织，在本协议中更多地称为&ldquo;您&rdquo;或&ldquo;开发者&rdquo;。&ldquo;其他用户&rdquo;是指包括其他QQ小程序用户和QQ用户等除用户本人外与小程序服务相关的用户。</p>
    
    <p>1.2 本服务是指腾讯根据本协议向用户提供的技术服务，包括远程接口调用、前端框架开发、服务连接渠道、数据加密传输以及与此相关的互联网应用技术等。其他用户使用小程序即成为该小程序的服务用户，开发者可通过QQ小程序为相关用户提供应用服务。</p>
    
    <p>1.3&nbsp;<strong>本协议的内容，包括但不限于以下与本平台和/或本服务相关的协议、规则、规范以及腾讯可能不断发布的关于本软件和/或本服务的相关协议、规则、规范等内容，前述内容一经正式发布，即为本协议不可分割的组成部分，与其构成统一整体。您同样应当遵守：</strong></p>
    
    <p><strong>（1）<a href="http://www.qq.com/contract.shtml" rel="noopener noreferrer" target="_blank">《腾讯服务协议》</a></strong></p>
    
    <p><strong>（2）<a href="http://ti.qq.com/agreement/index.html" rel="noopener noreferrer" target="_blank">《QQ软件许可及服务协议》</a></strong></p>
    
    <p><strong>（3）<a href="http://ti.qq.com/agreement/index.html" rel="noopener noreferrer" target="_blank">《QQ软件许可及服务协议》</a></strong></p>
    
    <p><strong>（4）<a href="https://ti.qq.com/agreement/qqface.html?appname=mqq_2019" rel="noopener noreferrer" target="_blank">《QQ隐私保护指引》</a></strong></p>
    
    <p><strong>（5）<a href="http://privacy.qq.com/" rel="noopener noreferrer" target="_blank">《腾讯隐私政策》</a></strong></p>
    
    <p><strong>二、【帐号注册与审核】</strong></p>
    
    <p>2.1 您在使用本服务前需要注册一个QQ小程序。QQ小程序通过邮箱进行绑定注册，每个邮箱仅可注册一个QQ小程序。腾讯有权根据用户需求和产品需要对帐号注册方式进行变更，关于您使用帐号的具体规则，请遵守本协议以及腾讯为此发布的专项规则。</p>
    
    <p>2.2 您在注册QQ小程序时需要选择帐号类型，且选择后将无法更改。QQ小程序在注册完成后，您可以对QQ小程序进行设置或修改。但您在对QQ小程序进行的设置或修改，不得以任何形式违反法律法规或侵害他人合法权益，并应当遵守相关本平台的相关规范。否则，腾讯有权随时不经通知对您的QQ小程序进行处理。</p>
    
    <p>2.3 腾讯有权对自行或委托第三方对QQ小程序的资质、名称、介绍等内容进行审核。完成所有审核流程后，由腾讯作出是否向您提供本服务的判断。腾讯将对您提交的资料及信息进行合理、谨慎的形式审查，但在腾讯的合法权限和合理能力范围内，腾讯无法实质审查开发者的实际经营、运营、提供服务以及推广等行为，并不为此提供任何担保。因您的行为导致与其他用户或第三方发生争议的，由您独立对外承担责任，因此给腾讯、其他用户或第三方造成损害的，您应当依法予以赔偿。</p>
    
    <p><strong>2.4 QQ小程序注册采用实名制，您应当如实填写和提交帐号注册与资质资料，完成信息登记，并对资料的真实性、合法性、准确性和有效性承担责任。腾讯依据您填写和提交的帐号资料，在法律允许的范围内向其他用户展示您的注册信息。如您提供服务或内容需要取得相关法律法规规定的许可、进行备案或取得相关合法资质的，您应当在帐号注册时进行明确说明并提交相应的许可、备案或资质证明。否则，腾讯有权拒绝或终止向您提供本服务，并依照本协议对违规帐号进行处罚。如因此给腾讯或第三方造成损害的，您应当依法予以赔偿。</strong></p>
    
    <p><strong>2.5 您理解并同意：</strong></p>
    
    <p><strong>（1）您用以参与本服务的QQ小程序由您独立维护、运营并独立承担全部责任。腾讯不会、也不可能参与该公众帐号的运营等独立活动；</strong></p>
    
    <p><strong>（2）腾讯自主开发并独立享有本服务技术接口的知识产权等合法权益，您仅在本服务范围内进行使用；</strong></p>
    
    <p><strong>（3）因您的原因导致的任何纠纷、责任等，以及您或您的QQ小程序违反相关法律法规或本协议约定引发的任何后果，均由您独立承担责任、赔偿损失，与腾讯无关。如侵害到腾讯或第三方权益的，您须自行承担全部责任和赔偿一切损失。</strong></p>
    
    <p><strong>三、【帐号的管理】</strong></p>
    
    <p><strong>3.1 QQ小程序的所有权归腾讯公司所有。用户在完成注册后获得QQ小程序的使用权。帐号使用权禁止赠与、借用、租用、转让或售卖。</strong></p>
    
    <p><strong>3.2 QQ小程序密码由您自行设定。腾讯特别提醒您应妥善保管您的帐号和密码。腾讯与您共同负有维护帐号安全的责任。腾讯会采取并不断更新技术措施，努力保护您的帐号在服务器端的安全。您需要采取特定措施保护您的帐号安全，包括但不限于妥善保管QQ小程序帐号与密码、安装防病毒木马软件、定期更改密码等措施。当您使用完毕后，应安全退出。您同意在任何情况下不向他人透露帐号或密码信息。因您保管不善可能导致帐号被他人使用（包括但不限于遭受盗号、密码失窃）或信息数据泄漏，责任由您自行承担。您理解并同意，在您未进行投诉或提出帐号申诉等方式明确告知腾讯帐号被他人使用或信息数据泄漏等情况并提供相关证明材料前，腾讯有理由相信该帐号行为是您使用帐号的行为。</strong></p>
    
    <p><strong>3.3 在您怀疑他人在使用您的帐号或密码时，您同意立即通知腾讯公司。如果您当前使用的QQ小程序并不是您初始申请注册的或者通过腾讯提供的其他途径获得的，但您却知悉该帐号当前的密码，您不得用该帐号登录或进行任何操作，并请您在第一时间通知腾讯或者该帐号的初始申请注册主体。如果腾讯发现您并非该帐号初始申请注册主体，腾讯有权在未经通知的情况下终止您使用该帐号。</strong></p>
    
    <p><strong>3.4 您理解并同意，为保护您及其他用户的数据安全，防止用户信息泄露、毁损、篡改或者丢失，腾讯有权对您接入的信息系统实行接入审查，包括但不限于技术水平审查、安全水平审查、主体资质审查等，并根据审查结果向您提出防入侵、防病毒等措施建议。若您的信息系统仍无法符合保护用户数据安全的要求，腾讯有权拒绝或终止提供本服务。</strong></p>
    
    <p><strong>3.5 如您违反相关法律法规的规定以及本协议、相关规范的约定，腾讯有权进行独立判断并随时限制、冻结或终止您对QQ小程序的使用，且根据实际情况决定是否恢复使用。由此给您带来的损失（包括但不限于通信中断，用户资料及相关数据清空等），由您自行承担。</strong></p>
    
    <p><strong>3.6 如果您的QQ小程序被盗、密码遗忘或因其他原因导致无法正常登录，您可以按照腾讯的申诉途径进行申诉。腾讯并不承诺您一定能通过申诉找回帐号。</strong></p>
    
    <p><strong>3.7 为了充分利用帐号资源，如果您存在长期未完成注册、注册QQ小程序后未及时进行初次登录使用，或长期未登陆使用QQ小程序等情形，腾讯有权终止该帐号的使用。</strong></p>
    
    <p><strong>四、【小程序开发与审核】</strong></p>
    
    <p>4.1 您应通过成功注册的QQ公众帐号进行小程序的开发。您可以对所注册的小程序进行设计、内部测试、编辑维护等初始化开发管理。但在腾讯对小程序的发布审核通过前，小程序将无法进行发布，即不会向其他用户进行展示，其他用户也无法搜索、添加该小程序。</p>
    
    <p>4.2 为确保QQ小程序平台、其他用户等各方的安全、稳定及良好的用户体验，腾讯将对需要发布的小程序进行发布审核。</p>
    
    <p>&ldquo;发布审核&rdquo;是指由开发者发起，将其完成初始化开发的小程序提交至腾讯，由腾讯自行或委托第三方对该小程序的合法性、合理性、安全性、稳定性、可操作性、用户体验等各方面，采用包括但不限于开发信息核对、安全测试、UI测试、随机测试、动态测试、安全测试等方式，进行审查、甄别、试验与评估的过程。发布审核结果包括审核通过与审核不通过两种。审核不通过的，该小程序将无法发布。</p>
    
    <p><strong>4.3 您清楚并同意，小程序发布审核服务是腾讯基于用户提交包括但不限于注册信息、使用范围、声明承诺、开发文档、使用说明等资料，在腾讯的合法权限和能力范围内所综合作出进行合理、谨慎的形式评估和判断服务。为向开发者提供更专业的服务，您同意授权腾讯可以自行或委托第三方对您所提交的发布审核申请进行审核。但腾讯无法实质审查开发者的实际经营、运营以及推广等行为，并不为此提供任何担保。您应仔细阅读有关小程序发布的各项协议、规范和规则，腾讯也尽可能为您提供各项常见拒绝情形，但由于客观上存在不断变化的法律法规、监管要求、产品规范和用户体验需求等各类因素，您的小程序被拒绝的理由未必包含在已经腾讯公布的条款中，由此所产生的法律后果由您独自承担。</strong></p>
    
    <p>&ldquo;拒绝&rdquo;是指提交发布审核的小程序被审核不通过，或者已经审核通过的小程序，被短期、长期或永久封禁，或采取限制或禁止发布等其他方式拒绝提供本服务。</p>
    
    <p><strong>4.4 发布审核通过后，开发者可以合理的方式、频率向腾讯提交版本优化、更新等发布审核申请。您理解并同意，发布审核将对腾讯产生人力和经济负担，若您在审核服务期内，恶意或非恶意（如技术水平、用户需求等）原因而导致过于频繁提交发布审核申请，腾讯有权对您采取要求支付发布审核服务费、暂停或终止向您提供发布审核服务等措施，由此产生的责任由您独自承担。开发者付款后，腾讯将根据开发者提交的发票信息向开发者开具等额合法有效发票，开发者应保证其提交的发票信息真实、准确及有效，否则因此导致的损失由开发者自行承担。</strong></p>
    
    <p><strong>4.5 您清楚理解并同意，发布的小程序都应当在腾讯所公布的类目范围中。为此，您应当真实、全面、不遗漏地根据您的小程序所提供的服务、从事的活动及所在的行业准确选择类目，使腾讯更好地识别您所提交的小程序可能涉及的法律法规及监管要求，进行相应的审核。若腾讯发现您所提交的小程序没有对应的类目，或者所提交的资质材料不符合相关类目的资质材料要求，将不能通过发布审核。同时，基于特定行业、特定领域的法律法规或监管要求，腾讯也可能在本服务条款及相关协议规范中进行特殊的约定，若您的小程序所提供的服务、从事的活动或所在的行业所对应的类目存在该等情况，您应遵守相关特殊的约定。</strong></p>
    
    <p><strong>4.6 您知悉、理解并同意，在发布审核通过后，用户可通过QQ小程序平台以及其他网站、应用程序、产品或终端设备等访问、使用开发者运营的小程序。您应按照本协议约定向所有用户提供服务，且不会就上述安排向腾讯主张任何责任。</strong></p>
    
    <p><strong>五、【用户个人信息保护】</strong></p>
    
    <p><strong>5.1 保护用户个人信息是腾讯的一项基本原则，腾讯将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可腾讯不会向第三方公开、透露用户个人信息。腾讯对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。</strong></p>
    
    <p><strong>5.2 您在申请本服务过程中，需要填写一些必要的信息，请保持这些信息的真实、准确、合法、有效并注意及时更新，以便腾讯向您提供及时有效的帮助，或更好地为您提供服务。根据相关法律法规和政策，请您填写真实的身份信息。若您填写的信息不完整或不准确，则可能无法使用本服务或在使用过程中受到限制。</strong></p>
    
    <p>5.3 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如帐号申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>
    
    <p>5.4 腾讯将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</p>
    
    <p><strong>5.5</strong>&nbsp;<strong>未经您的同意，腾讯不会向腾讯以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。</strong></p>
    
    <p><strong>5.6</strong>&nbsp;<strong>腾讯非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用腾讯的服务前，应事先取得您家长或法定监护人的书面同意。</strong></p>
    
    <p><strong>5.7</strong>&nbsp;<strong>您在申请和使用本服务过程中，需要按照要求准确填写、预留您与服务用户、其他用户的直接数据通信方式，以便该等数据能准确地实现加密传输，确保您、相关用户的信息安全。否则，由此造成相关信息的泄漏、丢失、损坏等，均与腾讯无关。</strong></p>
    
    <p>5.8如果您的小程序收集、存储、处理或使用终端用户的任何个人数据或信息（相关术语定义见适用法律）：</p>
    
    <p>(1) 您应遵守（且不得在知情的情况下让终端用户违反）本协议以及任何适用的法律法规（包括与个人数据处理相关的法律法规）。您应向腾讯提供所有必要的信息，以表明您遵守与隐私及数据安全相关的法律法规以及本第5.8条的要求，包括促使开展合规审计及/或检查。</p>
    
    <p>(2) 您应制定并遵守隐私政策，其中应清晰准确地向终端用户说明您收集哪些个人数据、如何使用这些信息（包括用于广告）以及如何与腾讯及其他第三方共享这些信息（如任何该等第三方是否向终端用户提供内容服务，或是否从终端用户处收集信息）。该等隐私政策必须至少遵守并符合本协议项下载明的条款和条件及《QQ隐私政策》（以适用者为准）。</p>
    
    <p>(3) 如果您在提供小程序时必须收集或处理任何用户的个人数据，您应在请求获取该等数据时征得用户对该等数据处理的明确同意。</p>
    
    <p>(4) 除非另行（包括根据您的隐私政策）获得了授权或同意，您仅可在对完成相关小程序的运作或功能而言属必要的情况下方可收集或处理用户的个人数据。您不得在相关小程序之外或为任何其它目的而使用该等数据。在不限制您在本协议或适用法律项下之义务的前提下，您应向终端用户告知您或您的代表直接或间接收集或处理数据的目的、范围和使用处理，从而向终端用户提供能够针对该等数据行使相关信息权的机制。</p>
    
    <p>(5) 对于腾讯所提供的任何个人数据而言，您仅可根据腾讯所提供的书面指示使用该等数据。如果腾讯要求删除该等数据，您应尽合理努力删除该等数据。</p>
    
    <p>(6) 您应在技术和组织层面采取适当的安全措施，以防止用户数据被擅自访问或使用，还应定期检查这些措施的有效性。在收集了用户数据之后，您必须采取合理的措施，以防止该等数据被盗或泄露。</p>
    
    <p>(7) 您应向用户提供修改和删除其数据的途径，如果任何用户需要删除其用户数据，其可自行予以删除，您则应确保相关的数据已被完全删除且无法恢复。</p>
    
    <p>(8) 您应协助腾讯处理终端用户根据适用的数据保护和隐私法律行使其权利的请求。</p>
    
    <p>(9) 未经腾讯事先书面同意，您不得将腾讯提供的任何个人数据转移到任何其它国家或传送给任何其他人士，且任何该等转移或传送均仅可在适用的数据和隐私法律许可的情况下进行。</p>
    
    <p>5.9 未经腾讯同意，您不得收集、处理、存储、抓取、获得或要求任何终端用户提供任何数据，包括但不限于QQ及/或其服务平台上含有的信息，如用户数据等。您不得使用任何违反本协议或适用法律法规而获得的数据，也不得将任何该等数据提供给任何第三方（包括您的任何客户）。</p>
    
    <p>5.10 未经腾讯事先书面同意，您不得将任何就QQ或小程序而获得的数据公开或私下用于任何促销、营销或广告活动。</p>
    
    <p>5.11 如果腾讯认为（由腾讯全权酌情判断）您收集、处理或使用任何与用户相关之信息的方式可能会损害或不利地影响到用户体验，您应根据腾讯的要求，及时删除相关的数据，并不再收集、处理或使用该等数据。如果腾讯要求您删除任何个人数据，您应(i)对相关的数据进行匿名化处理，从而使该等数据不再是个人数据（定义见适用的数据和隐私法律），或(ii)永久性地删除相关的数据或使该等数据不再可读。您必须根据腾讯的要求，向腾讯提供相关的个人数据已被匿名处理或删除的书面确认。</p>
    
    <p>5.12 腾讯可在任何时间限制或阻止您获取用户信息及/或QQ小程序内处理或存储的任何其它数据。</p>
    
    <p>5.13 除非相关的数据是用户根据法律所拥有的，任何数据、用户数据或QQ内处理或存储的其它数据中的一切权利都归腾讯所有，这些数据都属商业敏感信息，且都被视为腾讯的商业机密。您应确保能访问到个人数据的所有人都受保密义务约束。未经腾讯事先书面同意，您不得将前述数据用于本协议所载目的之外的任何其它目的，亦不得向任何第三方披露该等信息。</p>
    
    <p>5.14 一旦您出于任何原因不再使用小程序，或腾讯出于任何原因不再提供与小程序相关的服务，您应删除就此及小程序而获得的所有数据（包括备份的数据），且即刻起不再以任何方式使用该等数据。</p>
    
    <p>5.15 您应采取合理且安全的技术措施，保障因小程序而保存在腾讯服务器上的任何信息的安全。因您自己或您代表的行为（包括但不限于自行安装的软件、加密措施或其它安全措施）而产生的所有后果均由您自行承担。一旦发生任何擅自访问或使用个人数据的情况，您应及时向腾讯、终端用户及（如适用）相关的数据保护机构汇报。</p>
    
    <p><strong>六、【用户行为规范】</strong></p>
    
    <p><strong>6.1【信息内容规范】</strong></p>
    
    <p><strong>6.1.1 本协议所述信息内容是指用户使用本服务过程中所制作、复制、发布、传播的任何内容，包括但不限于小程序的头像、名称、介绍说明等注册信息，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用本平台或本服务所产生的内容， 也称&ldquo;小程序平台信息内容&rdquo;。</strong></p>
    
    <p><strong>6.1.2 您理解并同意，QQ小程序一直致力于为用户提供文明健康、规范有序的网络环境，您不得利用小程序制作、复制、发布、 传播如下干扰小程序平台正常运营，以及侵犯其他用户或第三方合法权益的内容：</strong></p>
    
    <p><strong>6.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容：</strong></p>
    
    <p><strong>（1）违反宪法确定的基本原则的；</strong></p>
    
    <p><strong>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</strong></p>
    
    <p><strong>（3）损害国家荣誉和利益的；</strong></p>
    
    <p><strong>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</strong></p>
    
    <p><strong>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</strong></p>
    
    <p><strong>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</strong></p>
    
    <p><strong>（7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</strong></p>
    
    <p><strong>（8）侮辱或者诽谤他人，侵害他人合法权益的；</strong></p>
    
    <p><strong>（9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；</strong></p>
    
    <p><strong>（10）以非法民间组织名义活动的；</strong></p>
    
    <p><strong>（11）不符合《即时通信工具公众信息服务发展管理暂行规定》及遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性 等&ldquo;七条底线&rdquo;要求的；</strong></p>
    
    <p><strong>（12）含有法律、行政法规禁止的其他内容的。</strong></p>
    
    <p><strong>6.1.2.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；</strong></p>
    
    <p><strong>6.1.2.3 涉及他人隐私、个人信息或资料的内容；</strong></p>
    
    <p><strong>6.1.2.4 发表、传送、传播骚扰信息、广告信息及垃圾信息或含有任何性或性暗示的内容；</strong></p>
    
    <p><strong>6.1.2.5 发布、传送、传播谣言、虚假信息或其他含有不实信息的内容；</strong></p>
    
    <p><strong>6.1.2.6 其他违反法律法规、政策及公序良俗、社会公德或干扰小程序平台正常运营和侵犯其他用户或第三方合法权益内容的信息。</strong></p>
    
    <p><strong>6.2 【平台使用规范】</strong></p>
    
    <p><strong>6.2.1</strong>&nbsp;<strong>本条所述平台使用是指用户使用本服务所进行的任何行为，包括但不限于注册登录、帐号运营推广以及其他使用QQ小程序所进行的行为。关于QQ小程序运营的具体规则，请阅读并遵守《QQ小程序平台运营规范》。</strong></p>
    
    <p><strong>6.2.2 您不得利用QQ小程序或本平台进行如下行为：</strong></p>
    
    <p><strong>6.2.2.1 提交、发布虚假信息；</strong></p>
    
    <p><strong>6.2.2.2 强制、诱导其他用户关注帐号、点击链接页面或分享信息的；</strong></p>
    
    <p><strong>6.2.2.3 虚构事实、隐瞒真相以误导、欺骗他人的；</strong></p>
    
    <p><strong>6.2.2.4 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；</strong></p>
    
    <p><strong>6.2.2.5 填写和提交帐号注册与认证资料违反本协议规定，以及运营行为与审核通过的类目无关的；</strong></p>
    
    <p><strong>6.2.2.6 未能按照QQ小程序平台业务流程注册和使用本服务，违反本服务功能限制或运营策略，或采取任何措施规避前述流程、限制或策略，干扰QQ小程序平台正常运营的；</strong></p>
    
    <p><strong>6.2.2.7 未经腾讯书面许可利用其他QQ小程序等任何功能，以及第三方运营平台进行推广或互相推广的；</strong></p>
    
    <p><strong>6.2.2.8 未经腾讯书面许可使用插件、外挂或通过其他第三方工具、运营平台或任何服务接入本服务和相关系统的；</strong></p>
    
    <p><strong>6.2.2.9 利用小程序或QQ小程序平台服务从事包括但不限于欺诈、传销、违法物品营销等任何违法犯罪活动的；</strong></p>
    
    <p><strong>6.2.2.10 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；</strong></p>
    
    <p><strong>6.2.2.11 仿冒、混淆他人帐号昵称、头像、功能介绍或发布内容等，或冒充、利用他人名义的；</strong></p>
    
    <p><strong>6.2.2.12 未经腾讯书面许可，自行或授权、允许、协助任何第三人对信息内容进行非法获取，用于包括但不限于宣传、增加阅读量、浏览量等商业用途 的。&ldquo;非法获取&rdquo;是指采用包括但不限于&ldquo;蜘蛛&rdquo;(spider)程序、爬虫程序、拟人程序等非真实用户或避开、破坏技术措施等非正常浏览的手段、方式，读取、 复制、转存、获得数据和信息内容的行为；</strong></p>
    
    <p><strong>6.2.2.13 未经腾讯书面许可，与第三方达成任何形式的协议、承诺或确认，在QQ小程序平台发布任何对本服务所提供的任何功能进行排他、排斥、排除、妨碍、阻碍、强制选择等非善意竞争的内容；</strong></p>
    
    <p><strong>6.2.2.14 任何导致或可能导致腾讯与第三方产生纠纷、争议或诉讼的行为。</strong></p>
    
    <p><strong>6.2.3 您在使用本服务的过程中，不得从事包括但不限于以下行为，也不得为以下行为提供便利（包括但不限于为其他用户的行为提供便利等）：</strong></p>
    
    <p><strong>6.2.3.1 删除、隐匿、改变本服务显示或其中包含的任何专利、著作权、商标或其他权利声明；</strong></p>
    
    <p><strong>6.2.3.2 以任何方式干扰或企图干扰腾讯任何产品、任何部分或功能的正常运行，或者制作、发布、传播上述工具、方法等；</strong></p>
    
    <p><strong>6.2.3.3 除无法绕开的内容显示需要外，未经腾讯书面许可，不得以腾讯名义使用任何腾讯商标标识或其任何变体、缩写、改写等；</strong></p>
    
    <p><strong>6.2.3.4 避开、尝试避开或声称能够避开任何内容保护机制，或导致用户认为其直接与腾讯及腾讯相关产品进行交互；</strong></p>
    
    <p><strong>6.2.3.5 除无法绕开的信息内容显示需要外，在未获得腾讯书面许可的情况下，以任何方式使用腾讯URL地址、技术接口等；</strong></p>
    
    <p><strong>6.2.3.6 在未经过用户同意的情况下，向任何其他用户及他方显示或以其他任何方式提供该用户的任何信息；</strong></p>
    
    <p><strong>6.2.3.7 在没有获得其他用户和腾讯明示同意的情况下，擅自以腾讯的名义向其他用户发布、发送商业广告等信息；</strong></p>
    
    <p><strong>6.2.3.8 为任何用户自动登录到本服务平台提供代理身份验证凭据；</strong></p>
    
    <p><strong>6.2.3.9 提供跟踪功能，包括但不限于识别其他用户在个人主页上查看、点击等操作行为；</strong></p>
    
    <p><strong>6.2.3.10 自动将浏览器窗口定向到其他网页；</strong></p>
    
    <p><strong>6.2.3.11 未经授权获取对腾讯产品或服务的访问权；</strong></p>
    
    <p><strong>6.2.3.12 发布的信息内容中含有计算机病毒、木马或者其他恶意程序、链接等任何可能危害腾讯或用户权益和终端信息安全等的内容；</strong></p>
    
    <p><strong>6.2.3.13 捏造或虚构事实，或未经腾讯书面同意，公开表达或暗示您与腾讯之间存在合作关系，包括但不限于相互持股、商业往来或合作关系等，或声称腾讯对您的认可；</strong></p>
    
    <p><strong>6.2.3.14 其他腾讯认为不应该、不适当的行为、内容。</strong></p>
    
    <p><strong>6.3 【对自己行为负责】</strong></p>
    
    <p><strong>您理解并同意，QQ小程序平台仅为用户提供信息分享、传播及获取的平台，您必须为自己注册帐号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。腾讯无法且不会对因前述风险而导致的任何损失或损害承担责任。</strong></p>
    
    <p><strong>6.4 您保证不对平台、技术接口、本服务数据进行反向工程（<strong><strong>reverse engineer</strong></strong>）、反向编译（<strong><strong>decompile</strong></strong>）或反汇编（<strong><strong>disassemble</strong></strong>）；不对平台、技术接口、本服务数据进行内容、功能、逻辑及界面等任何方面的修改；不得将平台、技术接口、本服务数据或业务用户本协议以外目的。</strong></p>
    
    <p><strong>七、【知识产权声明】</strong></p>
    
    <p><strong>7.1 腾讯在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归腾讯所有，用户在使用本服务中所产生的内容的知识产权归用户或相关权利人所有。用户在使用本服务中所产生的内容的知识产权归用户或相关权利人所有。</strong></p>
    
    <p><strong>7.2 除另有特别声明外，腾讯提供本服务时所依托软件的著作权、专利权及其他知识产权均归腾讯所有。腾讯在本服务中所使用的&ldquo;QQ&rdquo;、&ldquo;腾讯&rdquo;、&ldquo;TENCENT&rdquo;、企鹅形象等商业标识，其著作权或商标权归腾讯所有。</strong></p>
    
    <p><strong>7.3 开发者仅拥有根据本协议约定合法使用本服务或腾讯提供相关技术接口的权利，与本服务相关的技术接口、相关的著作权、专利权等相关全部权利归腾讯所有。未经腾讯许可，您不得违约或违法使用，不得向任何单位或个人出售、转让、授权腾讯的代码、技术接口及开发工具等。</strong></p>
    
    <p>7.4上述及其他任何本服务包含的内容的知识产权均受到法律保护，其他未经腾讯、用户或相关权利人许可的第三人，不得以任何形式进行使用或创造相关衍生作品。</p>
    
    <p><strong>7.5 因QQ小程序平台是一个为公众提供信息传播和服务的平台，为向所有用户提供更优质的服务，腾讯可能会对QQ小程序的名称、头像、介绍说明、公开发布的信息等公开非保密内容在法律允许的范围内进行使用，包括但不限于提供搜索、链接等服务。</strong></p>
    
    <p><strong>八、 【不可抗力及其他免责事由】</strong></p>
    
    <p><strong>8.1 您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务受到影响。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，腾讯将努力在第一时间与相关单位配合，争取及时进行处理，但是由此给您造成的损失腾讯在法律允许的范围内免责。</strong></p>
    
    <p><strong>8.2 在法律允许的范围内，腾讯对以下情形导致的服务中断或受阻不承担责任：</strong></p>
    
    <p><strong>（1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏。</strong></p>
    
    <p><strong>（2）用户或腾讯的电脑软件、系统、硬件和通信线路出现故障。</strong></p>
    
    <p><strong>（3）用户操作不当或用户通过非腾讯授权的方式使用本服务。</strong></p>
    
    <p><strong>（4）程序版本过时、设备的老化和/或其兼容性问题。</strong></p>
    
    <p><strong>（5）其他腾讯无法控制或合理预见的情形。</strong></p>
    
    <p><strong>8.3 您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，腾讯不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：</strong></p>
    
    <p><strong>（1）来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息。</strong></p>
    
    <p><strong>（2）遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失。</strong></p>
    
    <p><strong>（3）其他因网络信息或用户行为引起的风险。</strong></p>
    
    <p><strong>8.4 腾讯依据本协议约定获得处理违法违规内容的权利，该权利不构成腾讯的义务或承诺，腾讯不能保证及时发现违法行为或进行相应处理。</strong></p>
    
    <p><strong>8.5 您理解并同意：为了向您提供有效的服务，本服务会利用您和其他用户终端设备的处理器和带宽等资源。本服务使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。</strong></p>
    
    <p><strong>8.6 您理解并同意，您通过QQ小程序平台发布的内容可能会被其他用户或第三方复制、转载、修改或做其他用途，脱离您的预期和控制。用户应充分意识到上述风险的存在，任何不愿被他人获知的信息都不应在本平台发布。如果相关行为侵犯了您的合法权益，您可以向QQ小程序平台投诉，腾讯将依法进行处理。</strong></p>
    
    <p><strong>8.7 您理解并同意，因业务发展需要，腾讯保留单方面对本平台、本服务的全部或部分内容在任何时候不经任何通知的情况下变更、暂停、限制、终止或撤销的权利，用户需承担此风险。</strong></p>
    
    <p><strong>九、【法律责任】</strong></p>
    
    <p><strong>9.1 如果腾讯发现或收到他人投诉用户违反本协议约定的，腾讯有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、删除部分或全部关注用户、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚，并公告处理结果。腾讯也有权依照本协议及专项规则的规定，拒绝再向该主体提供服务。如果您发现任何人违反本协议规定或以其他不当的方式使用QQ小程序平台服务，请立即向本平台投诉，腾讯将依法进行处理。</strong></p>
    
    <p><strong>9.2 您理解并同意，腾讯有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何人士采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。</strong></p>
    
    <p><strong>9.3 您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；腾讯因此遭受损失的，您也应当一并赔偿。</strong></p>
    
    <p><strong>9.4 您理解并同意，为及时保障用户合法权益不受侵害，若您的QQ小程序存在权益纠纷，腾讯有权根据情况，采取包括但不限于暂停、冻结该小程序的部分或全部功能等保护措施，直至有权机关作出生效裁判或用户在不违反本协议的前提下协商一致，并由此所产生的一切法律责任均与腾讯无关。</strong></p>
    
    <p><strong>9.5 为保障平台管理措施的有效执行，避免利用注册不同帐号、设立或使用不同主体进行注册等方式绕开、避开或对抗平台的管理，对于同一主体，或其存在关联关系的主体（包括但不限于存在母子公司、总分公司关系，直接或间接的控股关系，实际控制人、董事、监事、高级管理人员与该主体存在直接或者间接控制的关系，协议控制VIE结构，或从证券市场披露、其官方宣传等能够确认存在关联的关系等）单独或合计多次存在违法、违规或违反本服务相关的协议规则的行为，腾讯有权不再提供申诉渠道，亦有权拒绝再为该等主体提供服务。</strong></p>
    
    <p><strong>十、【通知】</strong></p>
    
    <p>10.1 您使用本服务即视为您已阅读并同意受本协议的约束。<strong>腾讯有权在必要时修改本协议条款。腾讯可能会以包括但不限于在相关服务页面展示、网页公告、网页提示、电子邮箱、手机短信、常规的信件传送、您注册使用本服务的帐号管理系统内发送站内信等方式中的一种或多种，向您送达关于本服务的各种规则、通知、提示等信息，您可以在相关服务页面查阅最新版本的条款。本协议条款变更后，如果您继续使用本服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本服务</strong>。</p>
    
    <p>10.2 您同意，任何由于电子邮箱、手机号码、通讯地址等信息错误或其他不可归咎于腾讯的原因，导致您未收到相关规则、通知、提示等信息的，均不影响该等信息对您所产生的法律效力，并您应受其约束，由此产生的一切后果及责任由您自行承担。</p>
    
    <p>10.3 您也同意腾讯可以向您的电子邮件、手机号码等发送可能与本服务不相关的其他各类信息包括但限于商业广告等。</p>
    
    <p><strong>10.4 您清楚知悉并同意，若您有任何事项需要通知腾讯的，均应当按照本服务对外正式公布的联系方式或渠道系统进行提交，否则，腾讯将无法收到您的通知。</strong></p>
    
    <p><strong>十一、【其它】</strong></p>
    
    <p>11.1 鉴于本服务将涉及QQ小程序平台的技术开发，可能会不定期邀请部分用户参与内部测试。若被邀请且同意参与内部测试，未经腾讯书面同意，请勿向任何第三方以任何形式披露、展示、传递涉及本次内测的相关信息、资料。否则，腾讯可能会取消部分用户本次及其他内测资格等，由此造成腾讯损失的，用户也应一并赔偿。</p>
    
    <p><strong>11.2 本协议签订地为中华人民共和国广东省深圳市南山区。</strong></p>
    
    <p><strong>11.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</strong></p>
    
    <p><strong>11.4 若您和腾讯之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</strong></p>
    
    <p>11.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
    
    <p>11.6 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。（完）</p>
    
    <p>腾讯公司</p>
    `
}
module.exports = jsonData